//Напишите программу, которая на вход принимает число, 
//а на выход выдает его квадрат(число, умноженное само на себя.)

Console.WriteLine ("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(number*number);


// Поправили решение